; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-4 - location
	p0-5 - location
	p0-6 - location
	p1-3 - location
	p2-0 - location
	p2-1 - location
	p4-2 - location
	p4-7 - location
	p5-0 - location
	p5-7 - location
	p6-1 - location
	p7-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s7)
	(at driver3 s3)
	(at driver4 s7)
	(at driver5 s5)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s6)
	(at package2 s7)
	(at package3 s0)
	(at package4 s1)
	(at package5 s2)
	(at package6 s3)
	(at package7 s0)
	(at package8 s4)
	(at package9 s0)
	(at package10 s7)
	(at package11 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 32)
	(= (time-to-drive s3 s0) 32)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 52)
	(= (time-to-drive s7 s0) 52)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 13)
	(= (time-to-drive s0 s1) 13)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 30)
	(= (time-to-drive s2 s1) 30)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 47)
	(= (time-to-drive s5 s1) 47)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 39)
	(= (time-to-drive s6 s1) 39)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 73)
	(= (time-to-drive s5 s2) 73)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 18)
	(= (time-to-drive s1 s3) 18)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 9)
	(= (time-to-drive s7 s3) 9)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 41)
	(= (time-to-drive s0 s4) 41)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 87)
	(= (time-to-drive s1 s4) 87)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 25)
	(= (time-to-drive s2 s4) 25)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 62)
	(= (time-to-drive s7 s5) 62)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 65)
	(= (time-to-drive s7 s6) 65)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 42)
	(= (time-to-drive s2 s7) 42)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 28)
	(= (time-to-drive s4 s7) 28)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver4 s1)
	(at driver5 s7)
	(at truck1 s0)
	(at truck2 s5)
	(at truck3 s5)
	(at package1 s3)
	(at package2 s3)
	(at package3 s0)
	(at package4 s7)
	(at package5 s3)
	(at package6 s3)
	(at package7 s0)
	(at package8 s2)
	(at package9 s1)
	(at package10 s7)
	(at package11 s5)
	))

(:metric minimize (+ (* 3 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck2 s7)
   deleted: (at driver2 s7) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 16
2. (drive-truck truck2 s7 s2 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 420
   goals met: 5 of 16
3. (walk driver5 s5 p5-7)
   deleted: (at driver5 s5)
   added: (at driver5 p5-7)
   goals met: 5 of 16
4. (walk driver4 s7 p7-1)
   deleted: (at driver4 s7)
   added: (at driver4 p7-1)
   goals met: 5 of 16
5. (walk driver5 p5-7 s7)
   deleted: (at driver5 p5-7)
   added: (at driver5 s7)
   goals met: 6 of 16
6. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 16
7. (walk driver1 s4 p4-2)
   deleted: (at driver1 s4)
   added: (at driver1 p4-2)
   goals met: 6 of 16
8. (drive-truck truck2 s2 s4 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 420 to 695
   goals met: 6 of 16
9. (walk driver1 p4-2 s2)
   deleted: (at driver1 p4-2)
   added: (at driver1 s2)
   goals met: 6 of 16
10. (walk driver4 p7-1 s1)
   deleted: (at driver4 p7-1)
   added: (at driver4 s1)
   goals met: 7 of 16
11. (load-truck package8 truck2 s4)
   deleted: (at package8 s4)
   added: (in package8 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 7 of 16
12. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (fuel-used) from 695 to 1826
   goals met: 7 of 16
13. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 7 of 16
14. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 1826 to 2114
   goals met: 7 of 16
15. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 8 of 16
16. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 8 of 16
17. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 16
18. (drive-truck truck2 s3 s7 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (fuel-used) from 2114 to 2258
   goals met: 8 of 16
19. (unload-truck package4 truck2 s7)
   deleted: (in package4 truck2)
   added: (at package4 s7)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 9 of 16
20. (load-truck package2 truck2 s7)
   deleted: (at package2 s7)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 9 of 16
21. (drive-truck truck2 s7 s2 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   changed: (fuel-used) from 2258 to 2930
   goals met: 9 of 16
22. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 2930 to 3230
   goals met: 9 of 16
23. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3230 to 3360
   goals met: 10 of 16
24. (unload-truck package8 truck2 s2)
   deleted: (in package8 truck2)
   added: (at package8 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 16
25. (drive-truck truck2 s2 s5 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (fuel-used) from 3360 to 4309
   goals met: 12 of 16
26. (unload-truck package11 truck2 s5)
   deleted: (in package11 truck2)
   added: (at package11 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 13 of 16
27. (load-truck package9 truck1 s0)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 13 of 16
28. (drive-truck truck2 s5 s7 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 4309 to 4991
   goals met: 12 of 16
29. (drive-truck truck2 s7 s6 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s6)
   changed: (fuel-used) from 4991 to 5706
   goals met: 12 of 16
30. (load-truck package1 truck2 s6)
   deleted: (at package1 s6)
   added: (in package1 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 12 of 16
31. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 5706 to 6213
   goals met: 12 of 16
32. (drive-truck truck2 s1 s3 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 6213 to 6447
   goals met: 12 of 16
33. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 13 of 16
34. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 14 of 16
35. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 6447 to 6627
   goals met: 14 of 16
36. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (fuel-used) from 6627 to 7097
   goals met: 15 of 16
37. (drive-truck truck1 s0 s1 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 7097 to 7240
   goals met: 14 of 16
38. (unload-truck package9 truck1 s1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 15 of 16
39. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 7240 to 7370
   goals met: 16 of 16
